[{"head":["Devon Hirth","Design Technologist, Sole Proprietor","devon@expdesign.io"]},{"head":["Summary"],"text":"I am an interactive designer specializing in Front-end Web Development, User Interface Design, Data Visualization, and Creative Strategy. My work is positioned behind exp. which is a name that represents my point of view towards design. Experiences are moments facilitated by design. Often these moments are solutions to problems – created to help us live more fulfilling lives. My desire is to work with socially conscious brands creating high impact design.","sections":[]},{"head":["Experience"],"text":[],"sections":[{"head":["Design Technologist, Sole Proprietor at exp. design LLC","May 2009 - Present","(6 years 9 months)"],"text":"I provide brand strategy and full-stack web development services developing identities, stationary, posters, marketing websites, application interfaces, and data visualizations using my skills in Identity/Branding, User Experience Design, User Interface Design, and User Interface Engineering."},{"head":["Co-Founder, Chief Design Technologist at Quadrant.io","May 2014 - December 2015","(1 year 8 months)"],"text":"Quadrant.io is a toolkit that provides macroeconomic data. I am responsible for the branding, interface design, and front-end development of Quadrant.io’s web application and marketing sites and I am a core contributor of the creative strategy of the company using my skills in Creative Strategy, Creative Direction, Identity/Branding, User Experience Design, User Interface Design, Data Visualization, Front-end Web Development and User Interface Engineering."},{"head":["Design Technologist at Sideways Inc","September 2012 - March 2014","(1 year 7 months)"],"text":"Sideways NYC is a digital media agency focused digital design and social media strategy for multimedia, entertainment, hospitality, and nightlife brands. I programmed experiences for marketing websites and web applications using my skills in User Experience Design, Web Design, Front-end Web Development, User Interface Design, User Interface Development, and Animation."},{"head":["Web and Interactive Chair at AIGA St. Louis Chapter","2010 - September 2012","(2 years)"],"text":"The AIGA is a national professional association for design. Serving the local St. Louis chapter I coordinated digital communication between the board and our 358 member chapter by managing content on our website and online event systems, developing email campaigns and unique event websites, engaging the community through social media, and event volunteering."},{"head":["Interactive Designer at happyMedium","April 2012 - August 2012","(5 months)"],"text":"happyMedium is a digital creative agency focused on branding, mobile application development, and web development for local agencies, start-ups, and national brands. I designed, prototyped, and developed interactive experiences for mobile and desktop applications with a team of designers and developers using my skills in Creative Strategy, Identity/Branding, User Experience Design, Front-end Web Development, User Interface Design, and User Interface Engineering."},{"head":["Interactive Designer and Front-End Web Developer at 2e Creative","October 2009 - March 2012","(2 years 6 months)"],"text":"2e Creative is an agency that develops smart creative for life sciences, healthcare, and scientific publishing industries. I designed and programmed interactive experiences and produced video content and animations as a multimedia designer in the 2e Creative team using my skills in Creative Direction, Identity/Branding, User Experience Design, Front-end Web Development, User Interface Design, User Interface Engineering, Video Production and Animation."},{"head":["Intern at act3 studio","May 2008 - January 2009","(9 months)"],"text":"Act3 is a strategic and applied storytelling firm applying the principles of storytelling to help organizations solve their most challenging problems. I gained insight and experience to storytelling strategy along with other interns led directly by the Act3 founders as well as designed and programmed interactive experiences using my skills in Identity/Branding, User Experience Design, Front-end Web Development, User Interface Design, and User Interface Engineering."},{"head":["Student Involvement Graphic Design at Maryville University","2007 - 2009","(2 years)"],"text":"Supported campus life along with other student organizations by designing posters, fliers, identities, and publications for Maryville University faculty, staff, and students."}]},{"head":["Volunteer Experience"],"text":[],"sections":[{"head":["Web and Interactive Chair at AIGA St. Louis Chapter","January 2011 - September 2012","(1 year 9 months)"],"text":"The AIGA is a national professional association for design. Serving the local St. Louis chapter I coordinated digital communication between the board and a 358 member association by posting information on our website, managing online event systems, developing email campaigns and special event websites, engaging the community through social media, and event volunteering."},{"head":["Volunteer Designer at Catchafire","September 2012 - Present","(3 years 5 months)"],"text":"I provided skills-based volunteer services as a full-service web designer and developer, creating a website for a social technology company called Angaza Design (www.angazadesign.com)."}]},{"head":["Skills & Expertise"],"text":["Interaction Design","Branding & Identity","Data Visualization","Creative Direction","Web Design","User Experience","Web Development","Creative Strategy","User Interface Design","Animation","Typography","Illustration","Human-centered Design","Data Driven Applications","Web Components","Templating","JavaScript","D3.js","BEM","AngularJS","Python","PHP","Git","WordPress","Django"],"sections":[]},{"head":["Education"],"text":[],"sections":[{"head":["+Acumen"],"text":"Human-Centered Design for Social Innovation, 2014 - 2014"},{"head":["General Assembly"],"text":"Data Science, 2013 - 2014"},{"head":["3rd Ward"],"text":"Woodworking, Metalworking, Physical Computing, and Processing, 2012 - 2012"},{"head":["Maryville University of Saint Louis"],"text":"BFA, Graphic Design, 2006 - 2009"}]},{"head":["1 person has recommended Devon"],"text":"\"Devon embodies the type of individual who is constantly pushing oneself to new heights yet has his feet firmly planted in the realities of life and the business of doing smart creative. His willingness to tackle any challenge with commitment and dedication to excellence functions as a catalyst to propel any initiative that he undertakes to a heightened level. I am confident that one day he will be viewed as a trend leader within the creative industry.\" — Joe Toohey , managed Devon at 2e Creative","sections":[]}]
