[{"head":["Devon Hirth","Design Technologist","devon@expdesign.io"]},{"head":["Summary"],"text":"My experience ranges from design research to prototyping and implementation. Currently, I'm helping low- income New Yorkers address consumer debt with tech solutions. As a designer and engineer I have come up against many challenges, both creative and technical, and I derive a great deal of satisfaction overcoming them. Some of the most important skills I’ve learned doing this work includes illustrating complex ecosystems, finding insight to supplement knowledge, and listening to people’s needs.","sections":[]},{"head":["Experience"],"text":[],"sections":[{"head":["2016 Design Fellow at Blue Ridge Labs @ Robin Hood","June 2016 - Present","(4 months)"],"text":"Designed tech solutions for low-income New Yorkers that address Access to Justice issues in the areas of juvenile justice, foster care, and consumer debt. Skills included human-centered design, ecosystem mapping, journey mapping, prototyping, identity/branding, user experience design, user interface design, and full-stack engineering."},{"head":["Design Technologist, Sole Proprietor at exp. design","May 2009 - Present","(7 years 5 months)"],"text":"Provided brand strategy and full-stack web development services. Skills included identity/branding, user experience design, user interface design and engineering."},{"head":["Co-Founder, Chief Design Technologist at Quadrant.io","May 2014 - December 2015","(1 year 8 months)"],"text":"Engineered javascript web application and marketing site. Sole designer of product identity/iconography, marketing site, and web application interface. Designed and developed pitch decks and demo presentations. Programming language fluency included Python, Django, Flask, Javascript, JSON, D3, Node, Angular, Backbone, LoDash, jQuery, JS Hint, JSCS, NPM, Grunt, Gulp, PHP, Wordpress, Twig, Composer, WPEngine, CSS, LESS, Hologram, Amazon Web Services, EC2, S3, Cognito, Git, Auth0 Authentication Service, and Algolia Search Service."},{"head":["Design Technologist at Sideways Inc","September 2012 - March 2014","(1 year 7 months)"],"text":"Programmed interactive experiences for marketing websites and web applications. Skills included user experience design, web design, front-end web development. Programming language fluency included PHP, Wordpress, Cake, Symphony, Silex, Twig, Composer, Javascript, jQuery, Bower, NPM, Grunt, CSS, LESS, SASS, Subversion, Git, MongoDB."},{"head":["Interactive Designer at happyMedium","April 2012 - August 2012","(5 months)"],"text":"Designed, prototyped, and developed interactive experiences for mobile and desktop applications. Skills included creative strategy, identity/branding, user experience design, front-end web development. Programming language fluency included PHP, Wordpress, Javascript, jQuery, CSS, LESS."},{"head":["Interactive Designer and Front-End Web Developer at 2e Creative","October 2009 - March 2012","(2 years 6 months)"],"text":"I designed and programmed interactive experiences and produced video content and animations. Skills included creative direction, identity/branding, user experience design, front-end web development, user interface design, video production, and animation. Programming language fluency included PHP, Wordpress, Javascript, jQuery, Flash, Actionscript, CSS, HTML."},{"head":["Intern at act3 studio","May 2008 - January 2009","(9 months)"],"text":"Designed studio branding and identity. Designed and programmed interactive experiences. Skills included identity/branding, user experience design, front-end web development, and user interface design."}]},{"head":["Volunteer Experience"],"text":[],"sections":[{"head":["Web and Interactive Chair at AIGA Saint Louis","January 2011 - September 2012"],"text":"Coordinated digital communication between the board and a 358 member association by managing website and online event systems, developing email campaigns and special event websites, and engaging the community through social media and event volunteering."},{"head":["Volunteer Designer at Catchafire","September 2012 - Present"],"text":"I provide pro-bono design and development consulting to organizations with social causes."},{"head":["Volunteer Designer at Goodnik","June 2014 - Present"],"text":"I provide pro-bono design and development consulting to organizations with social causes."},{"head":["Assistant Trip Leader at Discover Outdoors Foundation","August 2016 - Present"],"text":"Assisting outdoor guides with providing outdoor experiences to kids from economically disadvantaged neighborhoods and schools."}]},{"head":["Skills & Expertise"],"text":["Interaction Design","Branding & Identity","Data Visualization","Creative Direction","Web Design","User Experience","Web Development","Creative Strategy","User Interface Design","Animation","Typography","Illustration","Human-centered Design","Data Driven Applications","Web Components","Templating","JavaScript","D3.js","BEM","AngularJS","Python","PHP","Git","WordPress","Django","Auth0","Auth0 Angular","SASS","Stylus","LESS","jQuery","Graphic Design","Ruby","Ruby on Rails"],"sections":[]},{"head":["Education"],"text":[],"sections":[{"head":["Maryville University of Saint Louis"],"text":"BFA, Graphic Design, 2006 - 2009"},{"head":["+Acumen"],"text":"Human-Centered Design for Social Innovation, 2014 - 2014"},{"head":["General Assembly"],"text":"Data Science, 2013 - 2014"},{"head":["3rd Ward"],"text":"Woodworking, Metalworking, Physical Computing, and Processing, 2012 - 2012"}]},{"head":["2 people have recommended Devon"],"text":[],"sections":[{"text":"\"Devon is both an exceptional designer and front-end developer. He's easy to work with and takes pride in everything he delivers. He's flexible enough to work with either a fixed set of requirements or a rough idea and make it great.\" — Dane Vrabac , Founder and CEO, Quadrant.io , managed Devon at Quadrant.io"},{"text":"\"Devon embodies the type of individual who is constantly pushing oneself to new heights yet has his feet firmly planted in the realities of life and the business of doing smart creative. His willingness to tackle any challenge with commitment and dedication to excellence functions as a catalyst to propel any initiative that he undertakes to a heightened level. I am confident that one day he will be viewed as a trend leader within the creative industry.\" — Joe Toohey , managed Devon at 2e Creative"}]}]
