{
  "title": "Resume",
  "skills": [
    "Design Research",
    "Identity Design",
    "Interface Design",
    "Front-end Web Development",
    "Data Visualization"
  ],
  "skip": [
    "Devon Hirth",
    "Summary",
    "Skills & Expertise"
  ],
  "resume": [
    {
      "head": [
        "Devon Hirth",
        "Product Designer and Front-end Web Developer",
        "devon@expdesign.io"
      ]
    },
    {
      "head": [
        "Summary"
      ],
      "text": "My experience ranges from design research to prototyping and implementation. Currently, I'm working with The Mayor's Office for Economic Opportunity (NYC Opportunity), part of the Mayor's Office of Operations, which works to reduce poverty and broaden opportunity. As a designer and engineer I have come up against many challenges, both creative and technical, and I derive a great deal of satisfaction overcoming them. One of the skills I value the most is being able to listen to people and use their insight to solve complex problems.",
      "sections": []
    },
    {
      "head": [
        "Experience"
      ],
      "text": [],
      "sections": [
        {
          "head": [
            "Front-end Web Developer, NYC Opportunity at Mayor's Office for Economic Opportunity",
            "May 2020 - Present"
          ],
          "text": "Working closely with design, data, and other technology team members to support all digital products in the Design and Product team portfolio through direct delivery, implementation of modern design patterns, and agile processes as well as consult on new cross-agency product strategy. Skills include design research, product design and full-stack web development."
        },
        {
          "head": [
            "Owner, Product Designer and Front-end Web Developer at exp. design",
            "May 2009 - Present"
          ],
          "text": "Provide brand strategy and full-stack web development services. Skills include design research, identity design, user experience design, user interface design, data visualization, and full-stack web development."
        },
        {
          "head": [
            "2016 Design Fellow at Blue Ridge Labs @ Robin Hood Foundation",
            "June 2016 - October 2016",
            "(5 months)"
          ],
          "text": "Used design research to create tech solutions for low-income New Yorkers that address Access to Justice issues in the areas of juvenile justice, foster care, and consumer debt. Launched product, DaisyDebt.org, that helps consumers with debt assert their rights against unlawful debt collection agencies. Skills included human-centered design, ecosystem mapping, journey mapping, prototyping, identity/branding, user experience design, user interface design, and full-stack engineering. Programming language fluency included Ruby, Ruby on Rails, Javascript, Git, Amazon Web Services, EC2, and Postgres. Co-Founder, Chief Design Technologist at Quadrant.io"
        },
        {
          "head": [
            "Co-Founder, Chief Design Technologist at Quadrant.io",
            "May 2014 - December 2015",
            "(1 year 8 months)"
          ],
          "text": "Engineered javascript web application and marketing site. Sole designer of product identity/iconography, marketing site, and web application interface. Designed and developed pitch decks and demo presentations. Programming language fluency included Python, Django, Flask, Javascript, JSON, D3, Node, Angular, Backbone, LoDash, jQuery, JS Hint, JSCS, NPM, Grunt, Gulp, PHP, Wordpress, Twig, Composer, WPEngine, CSS, LESS, Hologram, Amazon Web Services, EC2, S3, Cognito, Git, Auth0 Authentication Service, and Algolia Search Service."
        },
        {
          "head": [
            "Design Technologist at Sideways Inc",
            "September 2012 - March 2014",
            "(1 year 7 months)"
          ],
          "text": "Programmed interactive experiences for marketing websites and web applications. Skills included user experience design, web design, front-end web development. Programming language fluency included PHP, Wordpress, Cake, Symphony, Silex, Twig, Composer, Javascript, jQuery, Bower, NPM, Grunt, CSS, LESS, SASS, Subversion, Git, MongoDB."
        },
        {
          "head": [
            "Interactive Designer at happyMedium",
            "April 2012 - August 2012",
            "(5 months)"
          ],
          "text": "Designed, prototyped, and developed interactive experiences for mobile and desktop applications. Skills included creative strategy, identity/branding, user experience design, front-end web development. Programming language fluency included PHP, Wordpress, Javascript, jQuery, CSS, LESS."
        },
        {
          "head": [
            "Interactive Designer and Front-End Web Developer at 2e Creative",
            "October 2009 - March 2012",
            "(2 years 6 months)"
          ],
          "text": "Designed and programmed interactive experiences and produced video content and animations. Skills included creative direction, identity/branding, user experience design, front-end web development, user interface design, video production, and animation. Programming language fluency included PHP, Wordpress, Javascript, jQuery, Flash, Actionscript, CSS, HTML."
        },
        {
          "head": [
            "Intern at act3 studio",
            "May 2008 - January 2009",
            "(9 months)"
          ],
          "text": "Designed studio branding and identity. Designed and programmed interactive experiences. Skills included identity/branding, user experience design, front-end web development, and user interface design."
        }
      ]
    },
    {
      "head": [
        "Education"
      ],
      "text": "",
      "sections": [
        {
          "head": [
            "Maryville University of Saint Louis",
            "BFA, Graphic Design, 2006 - 2009"
          ],
          "text": ""
        },
        {
          "head": [
            "+Acumen",
            "Human-Centered Design for Social Innovation 2014 - 2014"
          ],
          "text": ""
        },
        {
          "head": [
            "General Assembly",
            "Data Science, 2013 - 2014"
          ],
          "text": ""
        },
        {
          "head": [
            "3rd Ward",
            "Woodworking, Metalworking, Physical Computing, and Processing, 2012 - 2012"
          ],
          "text": ""
        }
      ]
    },
    {
      "head": [
        "Recommendations"
      ],
      "text": "",
      "sections": [
        {
          "head": [
            "Linda Tvrdy, 2016 Civil Justice Fellow, Blue Ridge Labs @ Robin Hood Foundation",
            "Worked directly with Devon at Blue Ridge Labs @ Robin Hood Foundation"
          ],
          "text": "Devon is a deep thinker, who begins from a place of compassion. He meets people where they are, whether that person is a New Yorker City resident helping with user research or a legal academic without much tech experience. He unhesitatingly embraced the complexity of trying to improve access to justice for ordinary people. Without losing sight of that complexity, he designed tools that were elegant and effective, not to mention beautiful. In addition to being a first-rate designer, Devon also has “mad engineering skills” to quote one of our teammates. In addition to his professional skill, Devon is the definition of a team player. He preserved team cohesion by keeping us focused on our goals, and he facilitated ideation sessions that brought out the best each of us had to offer. I cannot recommend him highly enough."
        },
        {
          "head": [
            "Dane Vrabac, Founder and CEO, Quadrant.io",
            "Managed Devon at Quadrant.io"
          ],
          "text": "Devon is both an exceptional designer and front-end developer. He's easy to work with and takes pride in everything he delivers. He's flexible enough to work with either a fixed set of requirements or a rough idea and make it great."
        },
        {
          "head": [
            "Joe Toohey, Principal of 2e Creative",
            "Managed Devon at 2e Creative"
          ],
          "text": "Devon embodies the type of individual who is constantly pushing oneself to new heights yet has his feet firmly planted in the realities of life and the business of doing smart creative. His willingness to tackle any challenge with commitment and dedication to excellence functions as a catalyst to propel any initiative that he undertakes to a heightened level. I am confident that one day he will be viewed as a trend leader within the creative industry."
        }
      ]
    }
  ]
}